SmokyBob/Bluetti_ESP32/Bluetti_ESP32/BWifi.cpp
void update_root()
{
  String jsonString = "{";

  jsonString += "\"UPTIME\" : \"" + convertMilliSecondsToHHMMSS(millis()) + "\"" + ",";
  jsonString += "\"RUNNING_SINCE\" : \"" + runningSince + "\"" + ",";
  jsonString += "\"UPTIME_D\" : \"" + String(millis() / 3600000 / 24) + "\"" + ",";
  jsonString += "\"B_BT_CONNECTED\" : " + String(isBTconnected()) + "" + ",";
  jsonString += "\"BT_LAST_MEX_TIME\" : \"" + convertMilliSecondsToHHMMSS(getLastBTMessageTime()) + "\"" + ",";
  jsonString += "\"B_AC_OUTPUT_ON\" : " + String((bluetti_state_data[AC_OUTPUT_ON].f_value == "1")) + "" + ",";
  jsonString += "\"B_DC_OUTPUT_ON\" : " + String((bluetti_state_data[DC_OUTPUT_ON].f_value == "1")) + "" + ",";

  jsonString += "\"FREE_HEAP\" : \"" + String(ESP.getFreeHeap()) + "\"" + ",";
  jsonString += "\"TOTAL_HEAP\" : \"" + String(ESP.getHeapSize()) + "\"" + ",";
  jsonString += "\"PERC_HEAP\" : \"" + String((float(ESP.getFreeHeap()) / float(ESP.getHeapSize())) * 100) + "\"" + ",";

  if (((float(ESP.getFreeHeap()) / float(ESP.getHeapSize())) * 100) > 90 && wifiConfig.useDbgFilelog)
  {
    writeLog(F("SPIFFS usage over 90%. Log disabled"));
    wifiConfig.useDbgFilelog = false; // Disable Spiffs log
    saveConfig();
  }

  jsonString += "\"MAX_ALLOC\" : \"" + String(ESP.getMaxAllocHeap()) + "\"" + ",";
  jsonString += "\"MIN_ALLOC\" : \"" + String(ESP.getMinFreeHeap()) + "\"" + ",";

  jsonString += "\"SPIFFS_USED\" : \"" + String(SPIFFS.usedBytes()) + "\"" + ",";
  jsonString += "\"SPIFFS_TOTAL\" : \"" + String(SPIFFS.totalBytes()) + "\"" + ",";
  jsonString += "\"SPIFFS_PERC\" : \"" + String((float(SPIFFS.usedBytes()) / float(SPIFFS.totalBytes())) * 100) + "\"" + ",";

  jsonString += "\"SPIFFS_TOTAL\" : \"" + String(SPIFFS.totalBytes()) + "\"" + ",";

  int tmpInt = bluetti_state_data[TOTAL_BATTERY_PERCENT].f_value.toInt();

  if (BATT_PERC_MIN > tmpInt && tmpInt != 0)
  {
    BATT_PERC_MIN = tmpInt;
  }
  jsonString += "\"BATT_PERC_MIN\" : \"" + String(BATT_PERC_MIN) + "\"" + ",";
  if (BATT_PERC_MAX < tmpInt)
  {
    BATT_PERC_MAX = tmpInt;
  }
  jsonString += "\"BATT_PERC_MAX\" : \"" + String(BATT_PERC_MAX) + "\"" + ",";

  tmpInt = bluetti_state_data[DC_INPUT_POWER].f_value.toInt();

  if (DC_INPUT_MAX < tmpInt)
  {
    DC_INPUT_MAX = tmpInt;
  }
  jsonString += "\"DC_INPUT_MAX\" : \"" + String(DC_INPUT_MAX) + "\"" + ",";

  tmpInt = bluetti_state_data[DC_OUTPUT_POWER].f_value.toInt();

  if (DC_OUTPUT_MAX < tmpInt)
  {
    DC_OUTPUT_MAX = tmpInt;
  }
  jsonString += "\"DC_OUTPUT_MAX\" : \"" + String(DC_OUTPUT_MAX) + "\"" + ",";

  tmpInt = bluetti_state_data[AC_INPUT_POWER].f_value.toInt();

  if (AC_INPUT_MAX < tmpInt)
  {
    AC_INPUT_MAX = tmpInt;
  }
  jsonString += "\"AC_INPUT_MAX\" : \"" + String(AC_INPUT_MAX) + "\"" + ",";

  tmpInt = bluetti_state_data[AC_OUTPUT_POWER].f_value.toInt();

  if (AC_OUTPUT_MAX < tmpInt)
  {
    AC_OUTPUT_MAX = tmpInt;
  }
  jsonString += "\"AC_OUTPUT_MAX\" : \"" + String(AC_OUTPUT_MAX) + "\"" + ",";

#if USE_TEMPERATURE_SENSOR == 1
  jsonString += "\"TEMPERATURE_CURRENT\" : \"" + String(temperature) + "\"" + ",";

  if (TEMPERATURE_MAX < temperature)
  {
    TEMPERATURE_MAX = temperature;
  }
  jsonString += "\"TEMPERATURE_MAX\" : \"" + String(TEMPERATURE_MAX) + "\"" + ",";

  jsonString += "\"HUMIDITY_CURRENT\" : \"" + String(humidity) + "\"" + ",";

  if (HUMIDITY_MAX < humidity)
  {
    HUMIDITY_MAX = humidity;
  }
  jsonString += "\"HUMIDITY_MAX\" : \"" + String(HUMIDITY_MAX) + "\"" + ",";

#endif
#if USE_EXT_BAT == 1
  jsonString += "\"CURR_EXT_VOLTAGE\" : \"" + String(curr_EXT_Voltage) + "\"" + ",";

  String pwm_str = "OFF";

  if (_pwm_switch_status)
  {
    pwm_str = "ON";
  }
  jsonString += "\"PWM_SWITCH_STATUS\" : \"" + pwm_str + "\"" + ",";
#endif

  jsonString += "\"bluetti_state_data\" : {";
  for (int i = 0; i < sizeof(bluetti_state_data) / sizeof(device_field_data_t); i++)
  {
    String tmp = map_field_name(bluetti_state_data[i].f_name);
    tmp.toUpperCase();
    jsonString += "\"" + tmp + "\": " +
                  " \"" + bluetti_state_data[i].f_value + "\",";
  }
  jsonString = jsonString.substring(0, jsonString.length() - 1);
  jsonString += "},";
  String lastWebSocketTime = runningSince;
  if (!wifiConfig.APMode && wifiConfig.ssid.length() > 0)
  {
    struct tm timeinfo;
    if (!getLocalTime(&timeinfo, DEVICE_STATE_UPDATE * 1000))
    {
      Serial.println(F("Failed to obtain time"));
    }
    else
    {
      // Save start time as string in the preferred format
      // Full param list
      // https://cplusplus.com/reference/ctime/strftime/
      char buffer[80];
      strftime(buffer, 80, "%F %T", &timeinfo); // ISO

      lastWebSocketTime = String(buffer);
    }
  }

  jsonString += "\"lastWebSocketTime\" : \"" + lastWebSocketTime + "\"" + "}";
#if DEBUG <= 4
  Serial.println(jsonString); // print the string for debugging.
#endif
  webSocket.textAll(jsonString); // send the JSON object through the websocket
}

void root_HTML(AsyncWebServerRequest *request)
{
#if DEBUG <= 4
  Serial.print(F("handleRoot() running on core "));
  Serial.println(xPortGetCoreID());
#endif

  // logging
  float perc;
  perc = float(ESP.getFreeHeap()) / float(ESP.getHeapSize());
  String toLog = "";
  toLog = toLog + "Free Heap (Bytes): " + ESP.getFreeHeap() + " of " + ESP.getHeapSize() + " (" + perc * 100 + " %)";
  writeLog(toLog);

  toLog = "";
  perc = float(SPIFFS.usedBytes()) / float(SPIFFS.totalBytes());
  toLog = toLog + "SPIFFS Used (Bytes): " + SPIFFS.usedBytes() + " of " + SPIFFS.totalBytes() + " (" + perc * 100 + " %)";
  writeLog(toLog);

  toLog = "";
  toLog = toLog + "Alloc Heap (Bytes): " + ESP.getMaxAllocHeap() + " Min Free Heap (Bytes):" + ESP.getMinFreeHeap();
  writeLog(toLog);

  String html = getFileContent("/index.html");

  if (html.length() == 0)
  {
    request->send(200, "text/text; charset=utf-8", "index.html not found");
  }
  else
  {
    // Replace tags in the html template before sending it to the client
    request->send_P(200, "text/html; charset=utf-8", html.c_str(), processor);
  }
}

