SmokyBob/Bluetti_ESP32/Bluetti_ESP32/BWifi.cpp
void notFound(AsyncWebServerRequest *request)
{
  bool isPost = true;

  if (request->methodToString() == "GET")
    isPost = false;

  String message = "File Not Found\n\n";
  message += "URI: ";
  message += request->url();
  message += "\nMethod: ";
  message += request->methodToString();
  message += "\nArguments: ";
  message += request->args();
  message += "\n";
  for (uint8_t i = 0; i < request->args(); i++)
  {
    message += " " + request->getParam(i)->name() + ": " + request->getParam(i)->value() + "\n";
  }
  request->send(404, "text/plain", message);
}

void handleBTCommand(String topic, String payloadData)
{
  String topic_path = topic;
  topic_path.toLowerCase(); // in case we recieve DC_OUTPUT_ON instead of the expected dc_output_on

  Serial.print(F("Command arrived: "));
  Serial.print(topic);
  Serial.print(F(" Payload: "));
  String strPayload = payloadData;
  Serial.println(strPayload);

  bt_command_t command;
  command.prefix = 0x01;
  command.field_update_cmd = 0x06;

  for (int i = 0; i < sizeof(bluetti_device_command) / sizeof(device_field_data_t); i++)
  {
    if (topic_path.indexOf(map_field_name(bluetti_device_command[i].f_name)) > -1)
    {
      command.page = bluetti_device_command[i].f_page;
      command.offset = bluetti_device_command[i].f_offset;

      String current_name = map_field_name(bluetti_device_command[i].f_name);
      strPayload = map_command_value(current_name, strPayload);
    }
  }

  command.len = swap_bytes(strPayload.toInt());
  command.check_sum = modbus_crc((uint8_t *)&command, 6);

  sendBTCommand(command);
}

const char *PARAM_TYPE = "type";
const char *PARAM_VAL = "value";

void command_HTML(AsyncWebServerRequest *request)
{

  String topic = "";
  String payload = "";
  bool isPost = true;

  if (request->methodToString() == "GET")
    isPost = false;

  if (request->hasParam(PARAM_TYPE, isPost))
    topic = request->getParam(PARAM_TYPE, isPost)->value();

  if (request->hasParam(PARAM_VAL, isPost))
    payload = request->getParam(PARAM_VAL, isPost)->value();

  if (topic == "" || payload == "")
  {
    request->send(200, "text/plain", "command data invalid: " + String(PARAM_TYPE) + " " + topic + " - " + String(PARAM_VAL) + " " + payload);
  }
  else
  {
    request->send(200, "text/plain", "Hello, POST: " + String(PARAM_TYPE) + " " + topic + " - " + String(PARAM_VAL) + " " + payload);

    handleBTCommand(topic, payload);
  }
}

bool b_paramsSaved = false;
bool b_resetRequired = false;

String processor_config(const String &var)
{
  String toRet = "";

  if (var == F("TITLE"))
  {
    toRet = DEVICE_NAME;
  }
  else if (var == F("PARAM_SAVED"))
  {
    if (!b_paramsSaved)
    {
      toRet = F("hide");
    }
  }
  else if (var == F("RESTART_REQUIRED"))
  {
    if (!b_resetRequired)
    {
      toRet = F("hide");
    }
  }
  else if (var == F("BLUETTI_DEVICE_ID"))
  {
    toRet = wifiConfig.bluetti_device_id;
  }
  else if (var == F("WIFI_SCAN"))
  {
    toRet = getScanItemOut();
  }
  else if (var == F("B_APMODE"))
  {
    toRet = (wifiConfig.APMode) ? "checked" : "";
  }
  else if (var == F("SSID"))
  {
    toRet = wifiConfig.ssid;
  }
  else if (var == F("PASSWORD"))
  {
    toRet = wifiConfig.password;
  }
#ifdef IFTTT
  else if (var == F("B_USE_IFTT"))
  {
    toRet = (wifiConfig.useIFTT) ? "checked" : "";
  }
  else if (var == F("IFTT_KEY"))
  {
    toRet = wifiConfig.IFTT_Key;
  }
  else if (var == F("IFTT_EVENT_LOW"))
  {
    toRet = wifiConfig.IFTT_Event_low;
  }
  else if (var == F("IFTT_LOW_BL"))
  {
    toRet = wifiConfig.IFTT_low_bl;
  }
  else if (var == F("IFTT_EVENT_HIGH"))
  {
    toRet = wifiConfig.IFTT_Event_high;
  }
  else if (var == F("IFTT_HIGH_BL"))
  {
    toRet = wifiConfig.IFTT_high_bl;
  }
#endif
#if USE_EXT_BAT == 1
  else if (var == F("VOLT_SWITCH_OFF"))
  {
    toRet = wifiConfig.volt_Switch_off;
  }
  else if (var == F("VOLT_SWITCH_ON"))
  {
    toRet = wifiConfig.volt_Switch_ON;
  }
  else if (var == F("VOLT_MAX_BLUETT_PERC"))
  {
    toRet = wifiConfig.volt_MAX_BLUETT_PERC;
  }
  else if (var == F("VOLT_CALIBRATION"))
  {
    toRet = curr_EXT_Voltage;
  }
  else if (var == F("CURR_VOLT"))
  {
    toRet = curr_EXT_Voltage;
  }
#endif
  else if (var == F("B_SHOW_DEBUG_INFOS"))
  {
    toRet = (wifiConfig.showDebugInfos) ? "checked" : "";
  }
  else if (var == F("B_USE_DBG_FILE_LOG"))
  {
    toRet = (wifiConfig.useDbgFilelog) ? "checked" : "";
  }
  else if (var == F("BTLOGTIME_START"))
  {
    toRet = wifiConfig.BtLogTime_Start;
  }
  else if (var == F("BTLOGTIME_STOP"))
  {
    toRet = wifiConfig.BtLogTime_Stop;
  }
  else if (var == F("B_CLRSPIFF_ON_RST"))
  {
    toRet = (wifiConfig.clrSpiffOnRst) ? "checked" : "";
  }

  return toRet;
}

void config_HTML(AsyncWebServerRequest *request, bool paramsSaved = false, bool resetRequired = false)
{
  b_paramsSaved = paramsSaved;
  b_resetRequired = resetRequired;

  String html = getFileContent("/config.html");

  if (html.length() == 0)
  {
    request->send(200, "text/text; charset=utf-8", "config.html not found");
  }
  else
  {
#ifdef IFTTT
    html.replace(F("%IFTTT%"), getFileContent("/templates/IFTTT.html"));
#else
    html.replace(F("%IFTTT%"), F(""));
#endif
#ifdef USE_EXT_BAT
    html.replace(F("%EXT_BAT%"), getFileContent("/templates/EXT_BAT.html"));
#else
    html.replace(F("%EXT_BAT%"), F(""));
#endif
    // Replace tags in the html template before sending it to the client
    request->send_P(200, "text/html; charset=utf-8", html.c_str(), processor_config);
  }

  _rebootDevice = resetRequired;
}

void config_POST(AsyncWebServerRequest *request)
{
  bool resetRequired = false;

  bool isPost = true;

  if (request->methodToString() == "GET")
    isPost = false;

  String tmp = request->getParam("bluetti_device_id", isPost)->value();

  if (tmp.compareTo(wifiConfig.bluetti_device_id) != 0)
  {
    wifiConfig.bluetti_device_id = tmp;
    resetRequired = true;
  }

  if (request->hasParam("APMode", isPost))
  {
    if (wifiConfig.APMode != true)
    {
      resetRequired = true;
    }
    wifiConfig.APMode = true;
  }
  else
  {
    if (wifiConfig.APMode != false)
    {
      resetRequired = true;
    }
    wifiConfig.APMode = false;
  }

  char tmp1[50];
  strcpy(tmp1, request->getParam("ssid", isPost)->value().c_str());
  if (strcmp(tmp1, wifiConfig.ssid.c_str()) != 0)
  {
    wifiConfig.ssid = request->getParam("ssid", isPost)->value();
    resetRequired = true;
  }
  strcpy(tmp1, request->getParam("password", isPost)->value().c_str());
  if (strcmp(tmp1, wifiConfig.password.c_str()) != 0)
  {
    wifiConfig.password = request->getParam("password", isPost)->value();
    resetRequired = true;
  }

#ifdef IFTTT
  // IFTT (no restart required)
  if (request->hasParam("useIFTT", isPost))
  {
    wifiConfig.useIFTT = true;
    wifiConfig.IFTT_Key = request->getParam("IFTT_Key", isPost)->value();
    wifiConfig.IFTT_Event_low = request->getParam("IFTT_Event_low", isPost)->value();
    wifiConfig.IFTT_low_bl = request->getParam("IFTT_low_bl", isPost)->value().toInt();
    wifiConfig.IFTT_Event_high = request->getParam("IFTT_Event_high", isPost)->value();
    wifiConfig.IFTT_high_bl = request->getParam("IFTT_high_bl", isPost)->value().toInt();
  }
  else
  {
    wifiConfig.useIFTT = false;
  }
#endif
#if USE_EXT_BAT == 1
  wifiConfig.volt_Switch_off = request->getParam("volt_Switch_off", isPost)->value().toFloat();
  wifiConfig.volt_Switch_ON = request->getParam("volt_Switch_ON", isPost)->value().toFloat();
  wifiConfig.volt_MAX_BLUETT_PERC = request->getParam("volt_MAX_BLUETT_PERC", isPost)->value().toInt();
  float newVolt = request->getParam("newVolt_calibration", isPost)->value().toFloat();
  float oldVolt = request->getParam("baseVolt_calibration", isPost)->value().toFloat();
  Serial.printf("newVolt %.2f \n",newVolt);
  Serial.printf("baseVolt %.2f \n",oldVolt);
  if (newVolt != oldVolt)
  {
    // get the measured voltage prior to calibration
    oldVolt = oldVolt / wifiConfig.volt_calibration;

    wifiConfig.volt_calibration = newVolt / oldVolt;
    curr_EXT_Voltage = getVoltage();
  }
#endif

  wifiConfig.showDebugInfos = request->hasParam("showDebugInfos", isPost);
  wifiConfig._useBTFilelog = request->hasParam("_useBTFilelog", isPost);
  wifiConfig.useDbgFilelog = request->hasParam("useDbgFilelog", isPost);
  wifiConfig.BtLogTime_Start = request->getParam("BtLogTime_Start", isPost)->value();
  wifiConfig.BtLogTime_Stop = request->getParam("BtLogTime_Stop", isPost)->value();

  if (request->hasParam("clrSpiffOnRst", isPost))
  {
    wifiConfig.clrSpiffOnRst = true;
    resetRequired = true;
  }

  // Save configuration to Preferences
  saveConfig();

  // Config Data Updated, refresh the page
  config_HTML(request, true, resetRequired);
}

void invertBT_HTML(AsyncWebServerRequest *request)
{
  bool restartToReconnect = false;
  if (isBTconnected())
  {
    disconnectBT();
  }
  else
  {
    // IF BLE didn't\ create memory issues
    manualDisconnect = false;
    doScan = true;
    initBluetooth(); // restart the scan task
  }

  request->send(200, "text/html",
                "<html><body onload='location.href=\"./\"';></body></html>");

