SmokyBob/Bluetti_ESP32/Bluetti_ESP32/BWifi.cpp
  if (restartToReconnect)
  {
    ESP.restart();
  }
}

void showDebugLog_HTML(AsyncWebServerRequest *request)
{
  // File Download instead of show
  request->send(SPIFFS, "/debug_log.txt", "text/text", true);
}

void showDataLog_HTML(AsyncWebServerRequest *request)
{
  // File Download instead of show
  request->send(SPIFFS, "/bluetti_data.json", "text/text", true);
}

void onWebSocketEvent(AsyncWebSocket *server, AsyncWebSocketClient *client, AwsEventType type, void *arg, uint8_t *data, size_t len)
{
  switch (type)
  {
  case WS_EVT_CONNECT:
    Serial.printf("WebSocket client #%u connected from %s\n", client->id(), client->remoteIP().toString().c_str());
    update_root(); // update the webpage accordingly
    break;
  case WS_EVT_DISCONNECT:
    Serial.printf("WebSocket client #%u disconnected\n", client->id());
    break;
  case WS_EVT_DATA:
    // TODO: instead of post command
    // AwsFrameInfo *info = (AwsFrameInfo *)arg;
    // if (info->final && info->index == 0 && info->len == len && info->opcode == WS_TEXT)
    // {
    //   data[len] = 0;
    //   message = (char *)data;
    //   steps = message.substring(0, message.indexOf("&"));
    //   direction = message.substring(message.indexOf("&") + 1, message.length());
    //   Serial.print("steps");
    //   Serial.println(steps);
    //   Serial.print("direction");
    //   Serial.println(direction);
    //   notifyClients(direction);
    //   newRequest = true;
    // }
    break;
  case WS_EVT_PONG:
  case WS_EVT_ERROR:
    break;
  }
}

void streamFile(String filepath, String mime)
{
  File dataFile = SPIFFS.open(filepath, "r");

  dataFile.close();
}

void setWebHandles()
{
  // WebServerConfig
  server.serveStatic("/", SPIFFS, "/"); // Try the FS first for static files

  server.on("/", HTTP_GET, root_HTML);

  server.on("/rebootDevice", HTTP_GET, [](AsyncWebServerRequest *request)
            {
    request->send(200, "text/plain", "reboot in 2sec");
    writeLog("Device Reboot requested!");
    disconnectBT();//Gracefully disconnect from BT
    _rebootDevice = true; });

  server.on("/resetWifiConfig", HTTP_GET, [](AsyncWebServerRequest *request)
            {
    request->send(200, "text/plain", "reset Wifi and reboot in 2sec");
    _resetWifiConfig = true; });

  server.on("/resetConfig", HTTP_GET, [](AsyncWebServerRequest *request)
            {
    request->send(200, "text/plain", "reset FULL CONFIG and reboot in 2sec");
    resetConfig();
    _rebootDevice = true; });

  // Commands come in with a form to the /post endpoint
  server.on("/post", HTTP_POST, command_HTML);
  // ONLY FOR TESTING
  // server.on("/get", HTTP_GET, command_HTML);

  // endpoints to update the config WITHOUT reset
  server.on("/config", HTTP_GET, [](AsyncWebServerRequest *request)
            { config_HTML(request, false); });
  server.on("/config", HTTP_POST, config_POST);

  // BTDisconnect //TODO: post only with JS... when the html code is in a separate file
  server.on("/btConnectionInvert", HTTP_GET, invertBT_HTML);

  server.on("/debugLog", HTTP_GET, showDebugLog_HTML);

  server.on("/clearLog", HTTP_GET, [](AsyncWebServerRequest *request)
            {
              clearLog();
              request->send(200, "text/plain", "Log Cleared"); });

  server.on("/clearBtData", HTTP_GET, [](AsyncWebServerRequest *request)
            {
              clearBtData();
              request->send(200, "text/plain", "BtData Cleared"); });

  server.on("/dataLog", HTTP_GET, showDataLog_HTML);

  server.onNotFound(notFound);

  webSocket.onEvent(onWebSocketEvent); // Register WS event handler
  server.addHandler(&webSocket);

  AsyncElegantOTA.begin(&server); // Start AsyncElegantOTA
  server.begin();
}

#pragma endregion Async Ws handlers

class CaptiveRequestHandler : public AsyncWebHandler
{
public:
  CaptiveRequestHandler()
  {
    setWebHandles(); // Routes that are managed and don't need to be redirected
  }
  virtual ~CaptiveRequestHandler() {}

  bool canHandle(AsyncWebServerRequest *request)
  {
    // request->addInterestingHeader("ANY");
    return true;
  }

  void handleRequest(AsyncWebServerRequest *request)
  {
    Serial.println(F("<- Request redirected to captive portal"));

    AsyncResponseStream *response = request->beginResponseStream("text/plain");
    response->setCode(302);
    response->addHeader(F("Location"), (String)F("http://") + WiFi.softAPIP().toString());
    request->send(response);
  }
};

void wifiConnect(bool resetWifi)
{

  if (resetWifi)
  {
    // Reset AP Mode
    readConfigs();
    wifiConfig.APMode = true;
    wifiConfig.ssid = "";
    wifiConfig.password = "";
    saveConfig();
  }

  if (!wifiConfig.APMode && wifiConfig.ssid.length() > 0)
  {

    WiFi.mode(WIFI_STA);
    WiFi.begin(wifiConfig.ssid.c_str(), wifiConfig.password.c_str());

    unsigned long connectTimeout = millis();
    // Wait for connection
    while (WiFi.status() != WL_CONNECTED)
    {
      delay(500);
      Serial.print(F("."));
      if ((millis() - connectTimeout) > (5 * 60 * 1000))
      {
        Serial.println("Wifi Not connected with ssid: " + wifiConfig.ssid + " ! Force AP Mode");
        writeLog("Wifi Not connected with ssid: " + wifiConfig.ssid + " ! Force AP Mode");
        wifiConfig.APMode = true;
        saveConfig();
        break;
      }
    }
    Serial.println(F(""));
    Serial.println(F("IP address: "));
    Serial.println(WiFi.localIP());

    if (MDNS.begin(DEVICE_NAME))
    {
      Serial.println(F("MDNS responder started"));
    }
  }

  if (wifiConfig.APMode || wifiConfig.ssid.length() == 0)
  {

    //  Start AP MODE
    WiFi.softAP(DEVICE_NAME);
    Serial.println(F(""));
    Serial.println(F("IP address: "));
    Serial.println(WiFi.softAPIP());

    doCaptivePortal = true;
    /* Setup the DNS server redirecting all the domains to the apIP */
    dnsServer.setErrorReplyCode(DNSReplyCode::NoError);
    dnsServer.start(DNS_PORT, "*", WiFi.softAPIP());
    server.addHandler(new CaptiveRequestHandler()).setFilter(ON_AP_FILTER); // only when requested from AP
  }
}

void initBWifi(bool resetWifi)
{

  readConfigs();

  if (wifiConfig.salt != EEPROM_SALT)
  {
    Serial.println(F("Invalid settings in EEPROM, trying with defaults"));
    ESPBluettiSettings defaults;
    wifiConfig = defaults;
  }

  wifiConnect(resetWifi);

  if (!doCaptivePortal)
    setWebHandles();

  Serial.println(F("HTTP server started"));
  writeLog("HTTP server started");
  Serial.print(F("Bluetti Device id to search for: "));
  Serial.println(wifiConfig.bluetti_device_id);
  // Init Array
  copyArray(bluetti_device_state, bluetti_state_data, sizeof(bluetti_device_state) / sizeof(device_field_data_t));
}

unsigned long webSockeUpdate = 0;

void handleWebserver()
{
  if (doCaptivePortal)
  {
    // DNS
    dnsServer.processNextRequest();
  }

  if (!wifiConfig.APMode && wifiConfig.ssid.length() > 0 && runningSince.length() == 0)
  {
    struct tm timeinfo;
    if (!getLocalTime(&timeinfo, DEVICE_STATE_UPDATE * 1000))
    {
      Serial.println(F("Failed to obtain time"));
    }
    else
    {
      // Save start time as string in the preferred format
      // Full param list
      // https://cplusplus.com/reference/ctime/strftime/
      char buffer[80];
      strftime(buffer, 80, "%F %T", &timeinfo); // ISO

      runningSince = String(buffer);
    }
  }

  if ((unsigned long)(millis() - webSockeUpdate) >= DEVICE_STATE_UPDATE * 1000)
  {
    update_root();             // Update the root page with the latest data
    webSockeUpdate = millis(); // Use the snapshot to set track time until next event
  }

  webSocket.cleanupClients();
}

String runningSince;